Repository: VadimVthvPro/PRO_pitashka
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de, es, fr, ru

# kbmain8
source: Add a drunken glass of water
de: Ein getrunkenes Glas Wasser hinzufügen
es: Añade un vaso de agua
fr: Ajoutez un verre d'eau potable
ru: Добавить выпитый стаканчик воды

# kbmain9
source: Join the chat room
de: Dem Chatraum beitreten
es: Unirse a la sala de chat
fr: Rejoindre le salon de discussion
ru: Присоединиться к чату

# kbtren1
source: Light
de: Licht
es: Luz
fr: Lumière
ru: Лёгкая

# kbtren2
source: Moderate
de: Mäßig
es: Moderado
fr: Modéré
ru: Умеренная

# kbtren3
source: Heavy
de: Schwer
es: Pesado
fr: Lourd
ru: Тяжёлая

# kbmeal1
source: Breakfast
de: Frühstück
es: Desayuno
fr: Petit déjeuner
ru: Завтрак

# kbmeal2
source: Lunch
de: Mittagessen
es: Almuerzo
fr: Déjeuner
ru: Обед

# kbmeal3
source: Dinner
de: Abendessen
es: Cena
fr: Dîner
ru: Ужин

# kbsvo1
source: Day
de: Tag
es: Día
fr: Jour
ru: День

# kbsvo2
source: Month
de: Monat
es: Mes
fr: Mois
ru: Месяц

# kbsvo3
source: Year
de: Jahr
es: Año
fr: Année
ru: Год

# kbtype1
source: Power
de: Strom
es: Potencia
fr: Puissance
ru: Силовая

# kbtype2
source: Stretch
de: Dehnen
es: Estiramientos
fr: Étirements
ru: Растяжка

# kbtype3
source: Cardio
de: Kardio
ru: Кардио

# kbchoise1
source: Return to menu
de: Zurück zum Menü
es: Volver al menú
fr: Retour au menu
ru: Вернуться в меню

# kbchoise2
source: Correct technique.
de: Richtige Technik
es: Técnica correcta
fr: Technique correcte
ru: Правильная техника

# newl
source: Language changed 🇬🇧
de: Die Sprache wurde geändert 🇩🇪
es: Se ha modificado la redacción 🇪🇸
fr: La langue a été modifiée 🇫🇷
ru: Язык изменён 🇷🇺

# pitforweek
source: You are an experienced nutritionist. Create a detailed meal plan for a week (7 days) for a person with the following parameters: gender - {}, height - {} cm, age - {} years, BMI - {}, goal - {}. IMPORTANT REQUIREMENTS: 1. Use ONLY simple, affordable products that can be bought in any regular store or market (chicken, beef, fish, eggs, dairy, vegetables, cereals, pasta, bread) 2. NO exotic ingredients (quinoa, avocado, chia, chickpeas, etc.) 3. Recipes should be SIMPLE and quick to prepare (30-40 minutes maximum) 4. Dishes should be traditional and familiar to ordinary people 5. VARIETY is key! Use different types of meat, fish, and grains. Don't repeat the same dishes. Combine products creatively but simply. For example: not just buckwheat with chicken, but also baked fish with vegetables, omelet with mushrooms, pasta with meatballs, rice porridge with pumpkin 6. Consider the user's goal when calculating calories and macros 7. For each day specify: breakfast, lunch, dinner, 2 snacks 8. For each dish indicate approximate calories and macros 9. Add a grocery list for the week FORMATTING (CRITICALLY IMPORTANT!): • Use ONLY Markdown: ## for headings, **text** for bold, * for lists • DO NOT use HTML tags (<b>, <i>, <u>, etc.) - this will cause an error! • All tags must be paired (if you open ** - you must close **) • Structure your answer clearly: day of the week, meals, shopping list
de: Sie sind ein erfahrener Ernährungsberater. Erstellen Sie einen detaillierten Ernährungsplan für eine Woche (7 Tage) für eine Person mit folgenden Parametern: Geschlecht - {}, Größe - {} cm, Alter - {} Jahre, BMI - {}, Ziel - {}.\n\nWICHTIGE ANFORDERUNGEN:\n1. Verwenden Sie NUR einfache, erschwingliche Produkte, die in jedem Geschäft oder Markt gekauft werden können (Huhn, Rindfleisch, Fisch, Eier, Milchprodukte, Gemüse, Getreide, Nudeln, Brot)\n2. KEINE exotischen Zutaten (Quinoa, Avocado, Chia, Kichererbsen usw.)\n3. Rezepte sollten EINFACH und schnell zuzubereiten sein (maximal 30-40 Minuten)\n4. Gerichte sollten traditionell und gewöhnlichen Menschen vertraut sein\n5. Berücksichtigen Sie das Ziel des Benutzers bei der Berechnung von Kalorien und Makros\n6. Geben Sie für jeden Tag an: Frühstück, Mittagessen, Abendessen, 2 Snacks\n7. Geben Sie für jedes Gericht ungefähre Kalorien und Makros an\n8. Fügen Sie eine Einkaufsliste für die Woche hinzu\n\nFormatieren Sie die Antwort schön mit Überschriften (verwenden Sie ##), fettem Text (**Text**) und Listen.
es: Eres un nutricionista experimentado. Crea un plan de comidas detallado para una semana (7 días) para una persona con los siguientes parámetros: sexo - {}, altura - {} cm, edad - {} años, IMC - {}, objetivo - {}.\n\nREQUISITOS IMPORTANTES:\n1. Usa SOLO productos simples y asequibles que se pueden comprar en cualquier tienda o mercado regular (pollo, carne de res, pescado, huevos, productos lácteos, verduras, cereales, pasta, pan)\n2. SIN ingredientes exóticos (quinoa, aguacate, chía, garbanzos, etc.)\n3. Las recetas deben ser SIMPLES y rápidas de preparar (máximo 30-40 minutos)\n4. Los platos deben ser tradicionales y familiares para la gente común\n5. Ten en cuenta el objetivo del usuario al calcular calorías y macros\n6. Para cada día especifica: desayuno, almuerzo, cena, 2 meriendas\n7. Para cada plato indica las calorías aproximadas y los macros\n8. Agrega una lista de compras para la semana\n\nFormatea la respuesta de manera bonita con encabezados (usa ##), texto en negrita (**texto**) y listas.
fr: Vous êtes un nutritionniste expérimenté. Créez un plan alimentaire détaillé pour une semaine (7 jours) pour une personne avec les paramètres suivants: sexe - {}, taille - {} cm, âge - {} ans, IMC - {}, objectif - {}.\n\nEXIGENCES IMPORTANTES:\n1. Utilisez UNIQUEMENT des produits simples et abordables que l'on peut acheter dans n'importe quel magasin ou marché (poulet, bœuf, poisson, œufs, produits laitiers, légumes, céréales, pâtes, pain)\n2. AUCUN ingrédient exotique (quinoa, avocat, chia, pois chiches, etc.)\n3. Les recettes doivent être SIMPLES et rapides à préparer (30-40 minutes maximum)\n4. Les plats doivent être traditionnels et familiers aux gens ordinaires\n5. Tenez compte de l'objectif de l'utilisateur lors du calcul des calories et des macros\n6. Pour chaque jour, indiquez: petit-déjeuner, déjeuner, dîner, 2 collations\n7. Pour chaque plat, indiquez les calories approximatives et les macros\n8. Ajoutez une liste de courses pour la semaine\n\nFormatez la réponse joliment avec des titres (utilisez ##), du texte en gras (**texte**) et des listes.
ru: Ты - опытный нутрициолог. Составь подробный план питания на неделю (7 дней) для человека со следующими параметрами: пол - {}, рост - {} см, возраст - {} лет, ИМТ - {}, цель - {}. ВАЖНЫЕ ТРЕБОВАНИЯ: 1. Используй ТОЛЬКО простые, доступные продукты, которые можно купить в любом обычном магазине или на рынке (курица, говядина, рыба, яйца, молочные продукты, овощи, крупы, макароны, хлеб) 2. НИКАКИХ экзотических ингредиентов (кинуа, авокадо, чиа, нут и т.п.) 3. Рецепты должны быть ПРОСТЫМИ и быстрыми в приготовлении (30-40 минут максимум) 4. Блюда должны быть традиционными и привычными для обычных людей 5. РАЗНООБРАЗИЕ - ключ к успеху! Используй разные виды мяса, рыбы, круп. Не повторяй одни и те же блюда. Комбинируй продукты креативно, но просто. Например: не только гречка с курицей, но и запечённая рыба с овощами, омлет с грибами, макароны с тефтелями, рисовая каша с тыквой 6. Учитывай цель пользователя при расчете калорий и БЖУ 7. Для каждого дня укажи: завтрак, обед, ужин, 2 перекуса 8. Для каждого блюда укажи примерную калорийность и БЖУ 9. Добавь список покупок на неделю ФОРМАТИРОВАНИЕ (КРИТИЧЕСКИ ВАЖНО!): • Используй ТОЛЬКО Markdown: ## для заголовков, **текст** для жирного, * для списков • НЕ используй HTML-теги (<b>, <i>, <u> и т.д.) - это приведёт к ошибке! • Все теги должны быть парными (если открыл ** - обязательно закрой **) • Структурируй ответ четко: день недели, приёмы пищи, список покупок

# trenforweek
source: You are a professional fitness trainer. Create a detailed workout plan for a week (7 days) for a person with the following parameters: gender - {}, height - {} cm, age - {} years, BMI - {}, goal - {}. Consider the user's meal plan: {} Requirements: 1. Consider fitness level based on BMI 2. Workouts should be realistic and doable at home or in a regular gym 3. Specify sets, reps, and rest time 4. Add warm-up and cool-down for each day 5. Alternate muscle groups and types of load (day 1 - chest/arms, day 2 - legs, day 3 - back/shoulders, day 4 - rest or cardio) 6. Consider user's goal (mass gain / weight loss / maintenance) 7. For each exercise provide: proper technique, muscles involved, common mistakes 8. Indicate total workout duration 9. Add recovery tips FORMATTING (CRITICALLY IMPORTANT!): • Use ONLY Markdown: ## for headings, **text** for bold, * for lists • DO NOT use HTML tags (<b>, <i>, <u>, etc.) - this will cause an error! • All tags must be paired (if you open ** - you must close **) • Structure clearly: day of week, workout type, exercises, tips
de: Sie sind ein professioneller Fitnesstrainer. Erstellen Sie einen detaillierten Trainingsplan für eine Woche (7 Tage) für eine Person mit folgenden Parametern: Geschlecht - {}, Größe - {} cm, Alter - {} Jahre, BMI - {}, Ziel - {}.\n\nBerücksichtigen Sie den Ernährungsplan: {}\n\nAnforderungen:\n1. Berücksichtigen Sie das Fitnessniveau basierend auf dem BMI\n2. Trainings sollten realistisch und zu Hause oder im normalen Fitnessstudio durchführbar sein\n3. Geben Sie Sätze, Wiederholungen und Ruhezeit an\n4. Fügen Sie Aufwärmen und Abkühlen für jeden Tag hinzu\n5. Wechseln Sie Muskelgruppen und Belastungsarten ab\n6. Berücksichtigen Sie das Ziel des Benutzers (Massezunahme / Gewichtsverlust / Erhaltung)\n7. Geben Sie für jede Übung eine kurze Beschreibung der richtigen Technik\n\nFormatieren Sie die Antwort schön mit Überschriften (verwenden Sie ##), fettem Text (**Text**) und Listen.
es: Eres un entrenador de fitness profesional. Crea un plan de entrenamiento detallado para una semana (7 días) para una persona con los siguientes parámetros: sexo - {}, altura - {} cm, edad - {} años, IMC - {}, objetivo - {}.\n\nTen en cuenta el plan de alimentación: {}\n\nRequisitos:\n1. Ten en cuenta el nivel de condición física según el IMC\n2. Los entrenamientos deben ser realistas y realizables en casa o en un gimnasio regular\n3. Especifica series, repeticiones y tiempo de descanso\n4. Agrega calentamiento y enfriamiento para cada día\n5. Alterna grupos musculares y tipos de carga\n6. Ten en cuenta el objetivo del usuario (ganancia de masa / pérdida de peso / mantenimiento)\n7. Para cada ejercicio, proporciona una breve descripción de la técnica adecuada\n\nFormatea la respuesta de manera bonita con encabezados (usa ##), texto en negrita (**texto**) y listas.
fr: Vous êtes un entraîneur de fitness professionnel. Créez un plan d'entraînement détaillé pour une semaine (7 jours) pour une personne avec les paramètres suivants: sexe - {}, taille - {} cm, âge - {} ans, IMC - {}, objectif - {}.\n\nTenez compte du plan alimentaire: {}\n\nExigences:\n1. Tenez compte du niveau de condition physique basé sur l'IMC\n2. Les entraînements doivent être réalistes et réalisables à domicile ou dans une salle de sport ordinaire\n3. Indiquez les séries, les répétitions et le temps de repos\n4. Ajoutez un échauffement et un retour au calme pour chaque jour\n5. Alternez les groupes musculaires et les types de charge\n6. Tenez compte de l'objectif de l'utilisateur (prise de masse / perte de poids / maintien)\n7. Pour chaque exercice, donnez une brève description de la technique appropriée\n\nFormatez la réponse joliment avec des titres (utilisez ##), du texte en gras (**texte**) et des listes.
ru: Ты - профессиональный фитнес-тренер. Составь подробный план тренировок на неделю (7 дней) для человека со следующими параметрами: пол - {}, рост - {} см, возраст - {} лет, ИМТ - {}, цель - {}. Учитывай план питания пользователя: {} Требования: 1. Учитывай уровень физической подготовки исходя из ИМТ 2. Тренировки должны быть реалистичными и выполнимыми дома или в обычном зале 3. Укажи количество подходов, повторений и время отдыха 4. Добавь разминку и заминку для каждого дня 5. Чередуй группы мышц и виды нагрузки (день 1 - грудь/руки, день 2 - ноги, день 3 - спина/плечи, день 4 - отдых или кардио) 6. Учитывай цель пользователя (набор массы / похудение / поддержание) 7. Для каждого упражнения дай краткое описание техники выполнения, задействованных мышц и распространённых ошибок 8. Укажи общую продолжительность тренировки 9. Добавь советы по восстановлению ФОРМАТИРОВАНИЕ (КРИТИЧЕСКИ ВАЖНО!): • Используй ТОЛЬКО Markdown: ## для заголовков, **текст** для жирного, * для списков • НЕ используй HTML-теги (<b>, <i>, <u> и т.д.) - это приведёт к ошибке! • Все теги должны быть парными (если открыл ** - обязательно закрой **) • Структурируй ответ четко: день недели, тип тренировки, упражнения, советы

# mealai
source: You are an experienced home cook. Create a SIMPLE and TASTY recipe for a meal "{}". IMPORTANT REQUIREMENTS: 1. Use ONLY simple, affordable products from a regular store (chicken, fish, eggs, milk, vegetables, cereals, pasta) 2. NO exotic ingredients (quinoa, avocado, chia, bulgur, chickpeas, etc.) 3. Recipe should be understandable even for a beginner cook 4. Cooking time - no more than 40 minutes 5. Dish should be delicious, filling and healthy 6. IMPORTANT: Come up with an interesting but simple option! Not the most banal dish (not just "buckwheat with chicken"), but something a bit more creative, but made from simple products. For example: chicken rolls with cheese and herbs, baked fish with vegetables in sour cream, frittata with mushrooms 7. Indicate calories and macros per serving 8. Give step-by-step cooking instructions 9. Add useful cooking tips FORMATTING (CRITICALLY IMPORTANT!): • Use ONLY Markdown: ## for headings, **text** for bold, * for lists • DO NOT use HTML tags (<b>, <i>, <u>, etc.) - this will cause an error! • All tags must be paired (if you open ** - you must close **) • Structure: name, ingredients, instructions, calories/macros, tips
de: Sie sind ein erfahrener Hauskoch. Erstellen Sie ein EINFACHES und LECKERES Rezept für eine Mahlzeit \"{}\".\n\nWICHTIGE ANFORDERUNGEN:\n1. Verwenden Sie NUR einfache, erschwingliche Produkte aus dem normalen Geschäft (Huhn, Fisch, Eier, Milch, Gemüse, Getreide, Nudeln)\n2. KEINE exotischen Zutaten (Quinoa, Avocado, Chia, Bulgur, Kichererbsen usw.)\n3. Das Rezept sollte auch für einen Anfänger verständlich sein\n4. Zubereitungszeit - nicht mehr als 40 Minuten\n5. Das Gericht sollte lecker, sättigend und gesund sein\n6. Geben Sie Kalorien und Makros pro Portion an\n7. Geben Sie eine schrittweise Anleitung\n8. Fügen Sie nützliche Kochtipps hinzu\n\nFormatieren Sie die Antwort schön:\n- Verwenden Sie ## für Überschriften\n- **fetter Text** für wichtige Punkte\n- Nummerierte Listen für Anweisungen\n- Aufzählungslisten für Zutaten
es: Eres un cocinero casero experimentado. Crea una receta SIMPLE y SABROSA para una comida \"{}\".\n\nREQUISITOS IMPORTANTES:\n1. Usa SOLO productos simples y asequibles de una tienda regular (pollo, pescado, huevos, leche, verduras, cereales, pasta)\n2. SIN ingredientes exóticos (quinoa, aguacate, chía, bulgur, garbanzos, etc.)\n3. La receta debe ser comprensible incluso para un cocinero principiante\n4. Tiempo de preparación - no más de 40 minutos\n5. El plato debe ser delicioso, satisfactorio y saludable\n6. Indica las calorías y los macros por porción\n7. Da instrucciones de cocción paso a paso\n8. Agrega consejos útiles de cocina\n\nFormatea la respuesta de manera bonita:\n- Usa ## para encabezados\n- **texto en negrita** para puntos importantes\n- Listas numeradas para instrucciones\n- Listas con viñetas para ingredientes
fr: Vous êtes un cuisinier à domicile expérimenté. Créez une recette SIMPLE et SAVOUREUSE pour un repas \"{}\".\n\nEXIGENCES IMPORTANTES:\n1. Utilisez UNIQUEMENT des produits simples et abordables d'un magasin ordinaire (poulet, poisson, œufs, lait, légumes, céréales, pâtes)\n2. AUCUN ingrédient exotique (quinoa, avocat, chia, bulgur, pois chiches, etc.)\n3. La recette doit être compréhensible même pour un cuisinier débutant\n4. Temps de préparation - pas plus de 40 minutes\n5. Le plat doit être délicieux, rassasiant et sain\n6. Indiquez les calories et les macros par portion\n7. Donnez des instructions de cuisson étape par étape\n8. Ajoutez des conseils de cuisson utiles\n\nFormatez la réponse joliment:\n- Utilisez ## pour les titres\n- **texte en gras** pour les points importants\n- Listes numérotées pour les instructions\n- Listes à puces pour les ingrédients
ru: Ты - опытный домашний повар. Придумай ПРОСТОЙ и ВКУСНЫЙ рецепт для приёма пищи "{}". ВАЖНЫЕ ТРЕБОВАНИЯ: 1. Используй ТОЛЬКО простые, доступные продукты из обычного магазина (курица, рыба, яйца, молоко, овощи, крупы, макароны) 2. НИКАКИХ экзотических ингредиентов (кинуа, авокадо, чиа, булгур, нут, киноа и т.п.) 3. Рецепт должен быть понятным даже начинающему кулинару 4. Время приготовления - не более 40 минут 5. Блюдо должно быть вкусным, сытным и полезным 6. ВАЖНО: Придумай интересный, но простой вариант! Не самое банальное блюдо (не просто "гречка с курицей"), а что-то чуть более креативное, но из простых продуктов. Например: куриные рулетики с сыром и зеленью, рыба запечённая с овощами под сметаной, фриттата с грибами 7. Укажи калорийность и БЖУ на порцию 8. Дай пошаговую инструкцию приготовления 9. Добавь полезные советы по приготовлению ФОРМАТИРОВАНИЕ (КРИТИЧЕСКИ ВАЖНО!): • Используй ТОЛЬКО Markdown: ## для заголовков, **текст** для жирного, * для списков • НЕ используй HTML-теги (<b>, <i>, <u> и т.д.) - это приведёт к ошибке! • Все теги должны быть парными (если открыл ** - обязательно закрой **) • Структурируй ответ: название, ингредиенты, инструкция, КБЖУ, советы

# trenai
source: You are a professional fitness trainer. Create a detailed workout on the topic "{}" for a person with BMI {}. Requirements: 1. Consider fitness level based on BMI 2. Workout should be doable at home or in a regular gym 3. Specify sets, reps, rest time 4. Add warm-up (5-10 minutes) and cool-down/stretching (5-10 minutes) 5. For each exercise describe: - Proper execution technique - Which muscles are working - Common mistakes and how to avoid them 6. Indicate total workout duration 7. Give tips for beginners and advanced 8. Include 5-8 different exercises (not 1-2, but a full complex!) FORMATTING (CRITICALLY IMPORTANT!): • Use ONLY Markdown: ## for headings, **text** for bold, * for lists • DO NOT use HTML tags (<b>, <i>, <u>, etc.) - this will cause an error! • All tags must be paired (if you open ** - you must close **) • Structure: warm-up, main exercises (each in detail), cool-down, tips
de: Sie sind ein professioneller Fitnesstrainer. Erstellen Sie ein detailliertes Training zum Thema \"{}\" für eine Person mit BMI {}.\n\nAnforderungen:\n1. Berücksichtigen Sie das Fitnessniveau basierend auf dem BMI\n2. Das Training sollte zu Hause oder im normalen Fitnessstudio durchführbar sein\n3. Geben Sie Sätze, Wiederholungen, Ruhezeit an\n4. Fügen Sie Aufwärmen (5-10 Minuten) und Abkühlen/Dehnen (5-10 Minuten) hinzu\n5. Beschreiben Sie für jede Übung:\n - Richtige Ausführungstechnik\n - Welche Muskeln arbeiten\n - Häufige Fehler und wie man sie vermeidet\n6. Geben Sie die Gesamtdauer des Trainings an\n7. Geben Sie Tipps für Anfänger und Fortgeschrittene\n\nFormatieren Sie die Antwort schön mit Überschriften (##), fettem Text (**Text**) und Listen.
es: Eres un entrenador de fitness profesional. Crea un entrenamiento detallado sobre el tema \"{}\" para una persona con IMC {}.\n\nRequisitos:\n1. Ten en cuenta el nivel de condición física según el IMC\n2. El entrenamiento debe ser realizable en casa o en un gimnasio regular\n3. Especifica series, repeticiones, tiempo de descanso\n4. Agrega calentamiento (5-10 minutos) y enfriamiento/estiramientos (5-10 minutos)\n5. Para cada ejercicio describe:\n - Técnica de ejecución adecuada\n - Qué músculos trabajan\n - Errores comunes y cómo evitarlos\n6. Indica la duración total del entrenamiento\n7. Da consejos para principiantes y avanzados\n\nFormatea la respuesta de manera bonita con encabezados (##), texto en negrita (**texto**) y listas.
fr: Vous êtes un entraîneur de fitness professionnel. Créez un entraînement détaillé sur le thème \"{}\" pour une personne avec un IMC de {}.\n\nExigences:\n1. Tenez compte du niveau de condition physique basé sur l'IMC\n2. L'entraînement doit être réalisable à domicile ou dans une salle de sport ordinaire\n3. Indiquez les séries, les répétitions, le temps de repos\n4. Ajoutez un échauffement (5-10 minutes) et un retour au calme/étirements (5-10 minutes)\n5. Pour chaque exercice, décrivez:\n - La technique d'exécution appropriée\n - Quels muscles travaillent\n - Les erreurs courantes et comment les éviter\n6. Indiquez la durée totale de l'entraînement\n7. Donnez des conseils pour les débutants et les avancés\n\nFormatez la réponse joliment avec des titres (##), du texte en gras (**texte**) et des listes.
ru: Ты - профессиональный фитнес-тренер. Составь подробную тренировку на тему "{}" для человека с ИМТ {}. Требования: 1. Учитывай уровень физической подготовки исходя из ИМТ 2. Тренировка должна быть выполнима дома или в обычном зале 3. Укажи количество подходов, повторений, время отдыха 4. Добавь разминку (5-10 минут) и заминку/растяжку (5-10 минут) 5. Для каждого упражнения опиши: - Правильную технику выполнения - Какие мышцы работают - Частые ошибки и как их избежать 6. Укажи общую продолжительность тренировки 7. Дай советы для начинающих и продвинутых 8. Включи 5-8 разных упражнений (не 1-2, а полноценный комплекс!) ФОРМАТИРОВАНИЕ (КРИТИЧЕСКИ ВАЖНО!): • Используй ТОЛЬКО Markdown: ## для заголовков, **текст** для жирного, * для списков • НЕ используй HTML-теги (<b>, <i>, <u> и т.д.) - это приведёт к ошибке! • Все теги должны быть парными (если открыл ** - обязательно закрой **) • Структурируй ответ: разминка, основные упражнения (каждое подробно), заминка, советы

# ai_thinking
source: 🤔 AI is thinking about your answer...
de: 🤔 KI denkt über Ihre Antwort nach...
es: 🤔 La IA está pensando en tu respuesta...
fr: 🤔 L'IA réfléchit à votre réponse...
ru: 🤔 Нейросеть думает над ответом...
