Repository: VadimVthvPro/PRO_pitashka
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de, es, fr, ru

# start
source: Hi, {}! The PROpitashka bot helps you keep a personalized calculation of your nutrition and activity.
de: Hallo, {}! Der PROpitashka-Bot hilft dir dabei, eine personalisierte Berechnung deiner Ernährung und Aktivität zu führen.
es: ¡Hola, {}! El bot PROpitashka te ayuda a llevar un cálculo personalizado de tu nutrición y actividad.
fr: Bonjour {} ! Le robot PROpitashka t'aide à tenir un calcul personnalisé de ta nutrition et de ton activité.
ru: Привет, {}! Бот PROпиташка поможет тебе вести индивидуальный расчет твоего питания и активности.

# IInfo
source: {}, your weight is {}, your height is {}, your BMI is : {}, and your weight is {}.
de: {}, Ihr Gewicht ist {}, Ihre Größe ist {}, Ihr BMI ist : {}, und Ihr Gewicht ist {}.
es: {}, tu peso es {}, tu altura es {}, tu IMC es : {}, y su peso es {}.
fr: {Votre poids est de {}, votre taille de {}, votre IMC de :{}, et votre poids est de {}.
ru: {}, твой вес: {}, твой рост: {}, твой ИМТ: {}, и твой вес - это {}.

# SuccesfulEntrance
source: Successful login ✅. Now you have access to all the bot's functionality, you just need to select the desired function in the keyboard)
de: Erfolgreiche Anmeldung ✅. Jetzt haben Sie Zugriff auf alle Bot-Funktionen, wählen Sie einfach die gewünschte Funktion über die Tastatur aus)
es: Inicio de sesión con éxito ✅. Ahora tienes acceso a toda la funcionalidad del bot, sólo tienes que seleccionar la función deseada en el teclado)
fr: Connexion réussie ✅. Vous avez maintenant accès à toutes les fonctionnalités du bot, il suffit de sélectionner la fonction souhaitée dans le clavier).
ru: Успешный вход в систему ✅. Теперь тебе доступен весь функционал бота, достаточно просто выбрать желаемую функцию в клавиатуре)

# MissedReg
source: Your data isn't in the database 🙁 First of all, register.
de: Ihre Daten sind nicht in der Datenbank 🙁 Lassen Sie sich zunächst registrieren
es: Tus datos no están en la base de datos 🙁 Antes de nada, regístrate
fr: Vos coordonnées ne sont pas dans la base de données 🙁 Tout d'abord, inscrivez-vous
ru: Твоих данных в базе нет 🙁 Для начала пройди регистрацию

# height
source: Enter your height in centimeters:
de: Geben Sie Ihre Körpergröße in Zentimetern an:
es: Introduzca su estatura en centímetros:
fr: Entrez votre taille en centimètres :
ru: Введи свой рост в сантиметрах:

# age
source: Enter your date of birth in DD-MM-YYYY format: For example: 15-05-1990
de: Geben Sie Ihr Geburtsdatum im Format TT-MM-JJJJ ein: Zum Beispiel: 15-05-1990
es: Introduce tu fecha de nacimiento en formato DD-MM-AAAA: Por ejemplo: 15-05-1990
fr: Entrez votre date de naissance au format JJ-MM-AAAA : Par exemple : 15-05-1990
ru: Введи свою дату рождения в формате ДД-ММ-ГГГГ: Например: 15-05-1990

# sex
source: Pick your gender:
de: Wählen Sie Ihr Geschlecht:
es: Elige tu género:
fr: Choisissez votre sexe :
ru: Выбери свой пол:

# aim
source: Choose how you want to change
de: Wählen Sie, wie Sie sich verändern wollen
es: Elige cómo quieres cambiar
fr: Choisissez comment vous voulez changer
ru: Выбери, как хочешь измениться

# weight
source: Enter your weight in kilograms
de: Geben Sie Ihr Gewicht in Kilogramm ein
es: Introduzca su peso en kilogramos
fr: Saisissez votre poids en kilogrammes
ru: Введи свой вес в килограммах

# SuccesfulReg
source: Registration was successful ✅. Now you have access to all the functionality of the bot, you just need to select the desired function in the keyboard)
de: Die Registrierung war erfolgreich ✅. Jetzt haben Sie Zugriff auf alle Funktionen des Bots, Sie müssen nur die gewünschte Funktion in der Tastatur auswählen)
es: El registro se ha completado con éxito ✅. Ahora usted tiene acceso a toda la funcionalidad del bot, sólo tiene que seleccionar la función deseada en el teclado).
fr: L'enregistrement a été effectué avec succès ✅. Vous avez maintenant accès à toutes les fonctionnalités du bot, il vous suffit de sélectionner la fonction souhaitée dans le clavier).
ru: Регистрация пройдена успешно ✅. Теперь тебе доступен весь функционал бота, достаточно просто выбрать желаемую функцию в клавиатуре)

# info
source: {}, your weight is {}, your height is {}, your BMI is: {}, and your weight is {}
de: {}, Ihr Gewicht ist {}, Ihre Größe ist {}, Ihr BMI ist : {}, und Ihr Gewicht ist {}.
es: {}, tu peso es {}, tu altura es {}, tu IMC es : {}, y su peso es {}.
fr: {} Votre poids est de {}, votre taille de {}, votre IMC de : {}, et votre poids est de {}.
ru: {}, твой вес: {}, твой рост: {}, твой индекс массы тела: {}, и твой вес - это {}.

# imt1
source: much less than normal.
de: Starkes Untergewicht
es: Insuficiencia ponderal grave
fr: grave insuffisance pondérale
ru: сильно меньше нормы

# imt2
source: Insufficient mass
de: Untergewicht
es: Bajo peso
fr: Sous-pondération
ru: Недостаточная масса

# imt3
source: Normal
de: Norma
es: Norma
fr: Norma
ru: Норма

# imt4
source: Obesity
de: Fettleibigkeit
es: Obesidad
fr: Obésité
ru: Предожирение

# imt5
source: Obesity
de: Fettleibigkeit
es: Obesidad
fr: Obésité
ru: Ожирение

# svoYEAR
source: Over the past 12 months:{}your weight has changed from {} to {};{} on average you burned {} kilocalories in exercise per month;{} on average your diet was {} kilocalories {} at the beginning of the year your diet was {} kilocalories , and your final value was {} kilocalories, your B/M/I ratio averaged: {}/{}/{}, at the beginning of the year your P/F/C ratio was {}/{}/{} and the final value was {}/{}/{}, and you drank an average of {} milliliters of water each day.
de: In den letzten 12 Monaten:{} hat sich Ihr Gewicht von {} auf {} verändert;{} haben Sie durchschnittlich {} Kilokalorien pro Monat durch Bewegung verbrannt;{} Ihre Ernährung betrug durchschnittlich {} Kilokalorien {} zu Beginn des Jahres betrug Ihre Ernährung {} Kilokalorien, und Ihr Endwert betrug {} Kilokalorien, Ihr P/F/K -Verhältnis betrug im Durchschnitt: {}/{}/{}, zu Beginn des Jahres betrug Ihr -Verhältnis {}/{}/{} und der Endwert war {}/{}/{}, und Sie haben durchschnittlich {} Milliliter Wasser pro Tag getrunken.
es: En los últimos 12 meses:{}su peso ha cambiado de {} a {};{} de media quemó {} kilocalorías en ejercicio al mes;{} de media su dieta fue de {} kilocalorías {} a principios de año su dieta fue de {} kilocalorías , y su valor final fue de {} kilocalorías, su ratio P/G/H fue de media: {}/{}/{}, al principio del año su ratio G/L/I era de {}/{}/{}/{} y el valor final fue de {}/{}/{}/{}, y bebiste una media de {} mililitros de agua al día.
fr: Au cours des 12 derniers mois:{}votre poids est passé de {} à {};{} en moyenne, vous avez brûlé {} kilocalories par mois en faisant de l'exercice;{} en moyenne, votre régime alimentaire était de {} kilocalories {} au début de l'année, votre régime alimentaire était de {} kilocalories, et votre valeur finale était de {} kilocalories, votre rapport P/G/G était en moyenne de {}/{}/{}, et vous avez bu en moyenne {} millilitres d'eau par jour.
ru: За последние 12 месяцев:{} твой вес изменился с {} на {};{} в среднем за месяц ты сжигал {} килокалорий на тренировках;{} в среднем твой рацион составлял {} килокалорий {}в начале года твой рацион составлял {} килокаларий , а конечное значение {} килокалорий, соотношение Б/Ж/У в среднем: {}/{}/{}, в начале года твои Б/Ж/У составляли соотношение {}/{}/{} , а конечное значение {}/{}/{}, и было выпито в среднем {} милилитров воды каждый день.

# svoMONTH
source: {}, in one month, the following changes have occurred: your weight went from {} to {}, you exercised {} minutes per day every day while burning an average of {} kilocalories, your P/F/C ratio was {}/{}/{} and you drank about {} milliliters of water.I believe in you!
de: In einem Monat haben sich folgende Veränderungen ergeben: Ihr Gewicht hat sich von {} auf {} verändert, Sie haben täglich {} Minuten Sport getrieben und dabei im Durchschnitt {} Kilokalorien verbrannt, Ihr P/F/K-Verhältnis war {}/{}/{} und Sie haben etwa {} Milliliter Wasser getrunken.Ich glaube an Sie!
es: En un mes, se han producido los siguientes cambios: tu peso ha pasado de {} a {}, has hecho ejercicio durante {} minutos cada día, quemando una media de {} kilocalorías, tu ratio P/G/H ha sido de {}/{}/{} y has bebido unos {} mililitros de agua.¡Creo en ti!
fr: En un mois, les changements suivants se sont produits : votre poids est passé de {} à {}, vous avez fait de l'exercice pendant {} minutes chaque jour, brûlant en moyenne {} kilocalories, votre rapport P/G/G a été de {}/{}/{} et vous avez bu environ {} millilitres d'eau.je crois en vous !
ru: {}, за месяц произошли такие изменения: твой вес изменился с {} на {}, в день ты тренировался {} минут, сжигая при этом в среднем {} килокалорий, в день ты потреблял в среднем {} килокалорий, твои Б/Ж/У были в соотношении {}/{}/{} и выпивалось около {} милилитров воды. Я в тебя верю!

# svoDAY
source: {}, for {} you have the following results: you lost {} kilocalories during your workouts, your diet today consisted of {}, your caloric intake for the day was {}, you consumed P/F/C {}/{}/{}, and you drank {} milliliters of water. I believe in your success!!!
de: {}, für {} haben Sie folgende Ergebnisse: während des Trainings haben Sie {} Kilokalorien verloren, heute bestand Ihre Ernährung aus {}, der Kalorienwert Ihrer Ernährung war {}, während des Tages haben Sie P/F/K im Verhältnis {}/{}/{} zu sich genommen und {} Milliliter Wasser getrunken. Ich glaube an Ihren Erfolg!!!
es: {}, para {} tienes los siguientes resultados: durante el entrenamiento perdiste {} kilocalorías, hoy tu dieta consistió en {}, el valor calórico de tu dieta fue {}, durante el día consumiste P/G/H en la proporción {}/{}/{} y bebiste {} mililitros de agua. ¡¡¡Creo en tu éxito!!!
fr: {}, pour {} vous avez les résultats suivants : pendant l'entraînement vous avez perdu {} kilocalories, aujourd'hui votre alimentation était composée de {}, la valeur calorique de votre alimentation était de {}, pendant la journée vous avez consommé P/G/G dans le rapport {}/{}/{} et vous avez bu {} millilitres d'eau. Je crois en votre réussite !
ru: {}, за {} у тебя такие результаты: во время тренировок ты сбросил {} килокалорий, сегодняшний твой рацион состоял из {} калорийность рациона составила {}, за день было употреблено Б/Ж/У в соотношении {}/{}/{} и выпито {} милилитров воды. Я верю в твой успех!!

# svoPERIOD
source: Choose for which period you want to see the summary:
de: Wählen Sie den Zeitraum aus, für den Sie eine Zusammenfassung sehen möchten:
es: Seleccione el periodo para el que desea ver un resumen:
fr: Sélectionnez la période pour laquelle vous souhaitez obtenir un résumé :
ru: Выбери, за какой период ты хочешь увидеть сводку:

# begining
source: Now you can enter the foods you consumed today and the workouts you did today, and at the end of the day you'll get a report on your B/L/G for the day and calories consumed
de: Jetzt können Sie die Lebensmittel, die Sie heute verzehrt haben, und die Trainingseinheiten, die Sie heute absolviert haben, eingeben, und am Ende des Tages erhalten Sie einen Bericht über Ihren B/G/I-Wert für den Tag und die verbrauchten Kalorien.
es: Ahora puedes introducir los alimentos que has consumido hoy y los entrenamientos que has hecho hoy, y al final del día obtendrás un informe sobre tu B/G/I del día y las calorías consumidas
fr: Vous pouvez désormais saisir les aliments que vous avez consommés aujourd'hui et les séances d'entraînement que vous avez effectuées aujourd'hui. À la fin de la journée, vous obtiendrez un rapport sur votre B/G/I pour la journée et sur les calories consommées.
ru: Теперь ты можешь вводить продукты, которые ты сегодня употребил и тренировки, которые ты сегодня прошёл, а в конце дня ты будешь получать отчёт по твоим Б/Ж/У за день и затраченным калориям

# unhappy
source: The function is not yet available((
de: Die Funktion ist noch nicht verfügbar((
es: La función aún no está disponible((
fr: La fonction n'est pas encore disponible((
ru: Функция пока не доступна((

# ok
source: Good
de: Also gut.
es: De acuerdo.
fr: D'accord.
ru: Хорошо

# return
source: Return to menu
de: Zurück zum Menü
es: Volver al menú
fr: Retour au menu
ru: Вернуться в меню

# trenchoose
source: Pick which workout you'd like to do?
de: Wählen Sie aus, welches Training Sie machen möchten?
es: ¿Escoge qué entrenamiento te gustaría hacer?
fr: Choisissez la séance d'entraînement qui vous convient le mieux ?
ru: Выбери, какую тренировку ты хотел бы провести?

# choosemeal
source: Choose which meal you want to generate a recipe for:
de: Wählen Sie aus, für welches Gericht Sie ein Rezept erstellen möchten:
es: Elija para qué comida desea generar una receta:
fr: Choisissez le repas pour lequel vous souhaitez générer une recette :
ru: Выбери, для какого приёма пищи необходимо сгенерировать рецепт:

# recommend
source: The nutrition and exercise plans issued are only recommendations that you can follow at will.
de: Die ausgegebenen Ernährungs- und Trainingspläne sind lediglich Richtlinien, die Sie nach Belieben befolgen können.
es: Los planes de nutrición y entrenamiento publicados son sólo directrices que puede seguir como desee.
fr: Les plans de nutrition et d'entraînement proposés ne sont que des lignes directrices que vous pouvez suivre à votre guise.
ru: Выданные планы питания и тренировок являются лишь рекоменданиями, которые ты можешь выполнять по желанию.

# InProcess
source: Wait a couple seconds, the neural network is generating a response)
de: Warten Sie ein paar Sekunden, das neuronale Netz erzeugt eine Antwort)
es: Espere unos segundos, la red neuronal está generando una respuesta)
fr: Attendez quelques secondes, le réseau neuronal est en train de générer une réponse)
ru: Подожди пару секунд, нейросеть генерирует ответ)

# InfoInBase
source: Data written)
de: Die Daten werden aufgezeichnet)
es: Se registran los datos)
fr: Les données sont enregistrées)
ru: Данные записаны)

# cup
source: Glass added
de: Das Glas wurde hinzugefügt
es: Se ha añadido el cristal
fr: Le verre a été ajouté
ru: Стакан добавлен

# TrenType
source: Choose your workout type from the list below 🏋️
de: Wählen Sie aus, welche Trainingseinheit Sie heute absolviert haben:
es: Elige qué sesión de entrenamiento has hecho hoy:
fr: Le verre a été ajouté
ru: Выбери тип тренировки из списка ниже 🏋️

# gram
source: Enter how many grams were in this dish
de: Geben Sie ein, wie viel Gramm in diesem Gericht enthalten sind
es: Introduzca cuántos gramos contenía este plato
fr: Choisissez la séance d'entraînement que vous avez effectuée aujourd'hui :
ru: Введи, сколько грамм было в этом блюде

# foto
source: Photo stolen
de: Gestohlenes Foto
es: Foto robada
fr: Photo volée
ru: Фото схранено

# SengFoto
source: Send a photo for recognition
de: Senden Sie ein Foto zur Anerkennung
es: Envía una foto para que te reconozcan
fr: Envoyez une photo pour la reconnaissance
ru: Пришли фотографию для распознавания

# SendMes
source: Enter comma-delimited names of dishes:
de: Geben Sie die Namen der Gerichte durch Kommata getrennt ein:
es: Introduzca los nombres de los platos separados por comas:
fr: Saisissez les noms des plats en les séparant par des virgules :
ru: Введи через запятую названия блюд:

# ChooseTheWay
source: Choose how you would like to add the food eaten?
de: Wählen Sie aus, wie Sie die Lebensmittel, die Sie gegessen haben, hinzufügen möchten?
es: Elige cómo te gustaría añadir los alimentos que has comido.
fr: Choisissez comment vous souhaitez ajouter les aliments que vous avez mangés ?
ru: Выбери, как ты хотел бы добавить съеденную пищу?

# TrenCal
source: 🎉 Great job! 🏋️ Workout: {} ⏱ Duration: {} min 🔥 Calories burned: {} kcal Keep it up!
de: Das ist großartig! Du hast {} Kilokalorien während deines Trainings verbrannt. Gut gemacht!!!
es: Estupendo. Quemaste {} kilocalorías durante tu entrenamiento. ¡¡¡Así se hace!!!
fr: C'est très bien ! Tu as brûlé {} kilocalories pendant ton entraînement. Bravo !!!
ru: 🎉 Отличная работа! 🏋️ Тренировка: {} ⏱ Длительность: {} мин 🔥 Сожжено калорий: {} ккал Так держать!

# TrenCalDay
source: 💪 Total burned today: {} kcal
de: Sie haben heute {} Kilokalorien verbrannt. Gut gemacht!!!
es: Has quemado {}kilocalorías hoy. ¡Así se hace!
fr: Vous avez brûlé {} des kilocalories aujourd'hui. Bravo !!!
ru: 💪 Всего сегодня сожжено: {} ккал

# page_indicator
source: Page
ru: Страница

# main_menu_button
source: 🏠 Main Menu
ru: 🏠 Главное меню

# cancel_button
source: ❌ Cancel
ru: ❌ Отмена

# back_button
source: ⬅️ Back
ru: ⬅️ Назад

# next_button
source: Next ➡️
ru: Вперёд ➡️

# prev_button
source: ⬅️ Previous
ru: ⬅️ Назад

# no_trainings_available
source: ⚠️ Workout list is temporarily unavailable. Try again later.
ru: ⚠️ Список тренировок временно недоступен. Попробуйте позже.

# error_workout_not_found
source: ⚠️ Selected workout not found. Please choose from the list.
ru: ⚠️ Выбранная тренировка не найдена. Пожалуйста, выберите из списка.

# invalid_duration_range
source: ⚠️ Enter a realistic workout duration (1 to 300 minutes).
ru: ⚠️ Введите реалистичную длительность тренировки (от 1 до 300 минут).

# invalid_duration_format
source: ⚠️ Duration must be a number. For example: 45
ru: ⚠️ Длительность должна быть числом. Например: 45

# request_weight_for_workout
source: ⚖️ We need your current weight for accurate calorie calculation. Enter your weight in kilograms (e.g., 72.5):
ru: ⚖️ Для точного расчета калорий нужен твой текущий вес. Введи свой вес в килограммах (например: 72.5):

# invalid_weight_range
source: ⚠️ Enter a valid weight in kg (25 to 400).
ru: ⚠️ Введите реальный вес в кг (от 25 до 400).

# invalid_weight_format
source: ⚠️ Weight must be a number. For example: 72.5
ru: ⚠️ Вес должен быть числом. Например: 72.5

# error_db_save_weight
source: ⚠️ Error saving weight. Please try again.
ru: ⚠️ Произошла ошибка при сохранении веса. Попробуй еще раз.

# error_calorie_calculation
source: ⚠️ Couldn't calculate calories. Please try again.
ru: ⚠️ Не удалось рассчитать калории. Пожалуйста, попробуй еще раз.

# error_db_save_training
source: ⚠️ Error saving workout. Please try again.
ru: ⚠️ Ошибка при сохранении тренировки. Попробуй еще раз.

# error_general
source: ⚠️ An unexpected error occurred. Please start over.
ru: ⚠️ Произошла непредвиденная ошибка. Попробуй начать заново.

# return_to_main_menu
source: ✅ Returning to main menu.
ru: ✅ Возвращаемся в главное меню.

# workout_cancelled
source: ❌ Workout registration cancelled.
ru: ❌ Добавление тренировки отменено.

# workout_motivation_1
source: 💪 You're on the right path to your goal!
ru: 💪 Ты на верном пути к своей цели!

# workout_motivation_2
source: 🔥 Every workout brings you closer to your dream!
ru: 🔥 Каждая тренировка приближает тебя к мечте!

# workout_motivation_3
source: ⭐ Excellent work! Keep it up!
ru: ⭐ Отличная работа! Продолжай в том же духе!

# workout_motivation_4
source: 🏆 You're a champion! Keep going!
ru: 🏆 Ты - чемпион! Так держать!

# workout_motivation_5
source: 💯 Incredible results! Be proud of yourself!
ru: 💯 Невероятный результат! Гордись собой!

# workout_summary_day_title
source: 🏋️ Today's Workouts:
ru: 🏋️ Тренировки за сегодня:

# workout_summary_day_empty
source: No workouts today.
ru: Сегодня тренировок не было.

# workout_summary_day_item
source: • {} — {} min, {} kcal
ru: • {} — {} мин, {} ккал

# workout_summary_day_total
source: 📊 Today's Total:\n⏱ Duration: {} min\n🔥 Calories: {} kcal
ru: \n📊 Итого за день:\n⏱ Время: {} мин\n🔥 Калории: {} ккал

# workout_summary_week_title
source: 🏋️ This Week's Workouts:
ru: 🏋️ Тренировки за неделю:

# workout_summary_week_empty
source: No workouts this week.
ru: На этой неделе тренировок не было.

# workout_summary_week_total
source: 📊 Week's Total:\n🔢 Workouts: {}\n⏱ Avg duration: {} min\n🔥 Avg calories: {} kcal/day
ru: \n📊 Итого за неделю:\n🔢 Тренировок: {}\n⏱ Среднее время: {} мин\n🔥 Средние калории: {} ккал/день

# workout_summary_month_title
source: 🏋️ Top 5 Workouts This Month:
ru: 🏋️ Топ-5 тренировок за месяц:

# workout_summary_month_empty
source: No workouts this month.
ru: В этом месяце тренировок не было.

# workout_summary_month_item
source: {}. {} — {} time(s), {} min avg
ru: {}. {} — {} раз(а), {} мин в среднем

# workout_summary_month_total
source: 📊 Month's Total:\n🔢 Total workouts: {}\n⏱ Avg duration: {} min\n🔥 Avg calories: {} kcal/day
ru: \n📊 Итого за месяц:\n🔢 Всего тренировок: {}\n⏱ Среднее время: {} мин\n🔥 Средние калории: {} ккал/день

# workout_summary_year_title
source: 🏋️ Top 5 Workouts This Year:
ru: 🏋️ Топ-5 тренировок за год:

# workout_summary_year_empty
source: No workouts this year.
ru: В этом году тренировок не было.

# workout_summary_year_item
source: {}. {} — {} time(s), {} min avg
ru: {}. {} — {} раз(а), {} мин в среднем

# workout_summary_year_total
source: 📊 Year's Total:\n🔢 Total workouts: {}\n⏱ Avg duration: {} min\n🔥 Avg calories: {} kcal/day
ru: \n📊 Итого за год:\n🔢 Всего тренировок: {}\n⏱ Среднее время: {} мин\n🔥 Средние калории: {} ккал/день

# workout_summary_avg_duration
source: ⏱ Average workout duration: {} min
ru: ⏱ Средняя длительность тренировки: {} мин

# workout_summary_total_calories
source: 🔥 Total calories burned: {} kcal
ru: 🔥 Всего сожжено калорий: {} ккал

# trenMIN
source: Excellent! You chose: {}. Now enter the workout duration in minutes (1 to 300):
de: Okay, und geben Sie ein, wie viele Minuten Ihr Training gedauert hat:
es: Vale, e introduce cuántos minutos ha durado tu entrenamiento:
fr: Ok, et entrez le nombre de minutes qu'a duré votre séance d'entraînement :
ru: Отлично! Ты выбрал: {}. Теперь введи длительность тренировки в минутах (от 1 до 300):

# kbENTRANCE
source: Entry
de: Eintrag
es: Entrada
fr: Entrée
ru: Вход

# kbREG
source: Registration
de: Anmeldung
es: Inscripción
fr: Inscription
ru: Регистрация

# kbENTRANCE2PROG
source: Login to program
de: Anmeldung zum Programm
es: Acceder al programa
fr: Se connecter au programme
ru: Вход в програму

# kbreREG
source: Registration
de: Anmeldung
es: Inscripción
fr: Inscription
ru: Регистрация

# kbMAN
source: Male
de: Mann
es: Hombre
fr: L'homme
ru: Мужчина

# kbWOMAN
source: Woman
de: Frau
es: Mujer
fr: Femme
ru: Женщина

# kbfood1
source: With a photo
de: Mit Hilfe eines Fotos
es: Con la ayuda de una foto
fr: A l'aide d'une photo
ru: С помощью фото

# kbfood2
source: With text
de: Mit Hilfe von Text.
es: Con la ayuda del texto.
fr: A l'aide d'un texte.
ru: С помощью текста

# kbwant1
source: Weight loss
de: Gewichtsverlust
es: Pérdida de peso
fr: Perte de poids
ru: Сброс веса

# kbwant2
source: Mass retention
de: Gewichtserhaltung
es: Retención de peso
fr: Maintien du poids
ru: Удержание массы

# kbwant3
source: Weight gain
de: Gewichtszunahme
es: Aumento de peso
fr: Prise de poids
ru: Набор веса

# kbmain1
source: Add training
de: Ausbildung hinzufügen
es: Añadir formación
fr: Ajouter une formation
ru: Добавить тренировки

# kbmain2
source: Enter a day's worth of food
de: Das Essen des Tages einführen
es: Introducir la comida del día
fr: Présenter les aliments du jour
ru: Ввести еду за день

# kbmain3
source: Summary
de: Zusammenfassung
es: Resumen
fr: Résumé
ru: Сводка

# kbmain4
source: Help with the recipe
de: Hilfe bei einem Rezept
es: Ayuda con una receta
fr: Aide pour une recette
ru: Помочь с рецептом

# kbmain5
source: Help with training
de: Hilfe bei der Ausbildung
es: Ayuda a la formación
fr: Aide à la formation
ru: Помочь с тренировкой

# kbmain6
source: Change language
de: Änderung der Sprache
es: Cambio lingüístico
fr: Changement de langue
ru: Смена языка

# kbmain7
source: Weekly nutrition and exercise plan
de: Wöchentlicher Ernährungs- und Trainingsplan
es: Plan semanal de nutrición y entrenamiento
fr: Plan hebdomadaire de nutrition et d'entraînement
ru: Недельный план питания и тренировок
